In [1]:
#project 5
import pandas as pd
import os
import sqlite3

In [5]:
titanic= pd.read_csv('~/test.csv')

891 records This does not represent the total number of people on the Titanic. Passengers = 1317 and with crew = 2224.  more than 1500 died

This list contains 891 records

Survival 0 1
pClass   passenger class

name

sex
age  Age there are only 714
sibsp   number of siblings/spouses aboard
parch   number of parents/children aboard
ticket  ticket number
fare    passenger fare
cabin   cabin  Cabin assignments  there are only 204
embarked  point of embarkation  (C=Cherbourg, Q Queenstown, S Southampton Embarking location = 889

In [6]:
titanic['SibSp'].describe()

count    891.000000
mean       0.523008
std        1.102743
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

In [7]:
titanic['SibSp'].sum()

466

In [8]:
titanic.tail(1)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:
tColumms = []
i=0
for labels in titanic.columns:  
    if i >=0:
        tColumms.append(labels)
        i = i+1
    else:
        i=i+1

for item in tColumms:
    print 'For %s' %item
    print titanic.dtypes[item] 
    print titanic[item].isnull().sum()
    print titanic[item].describe()
    print ' '

For index
int64
0
count    891.000000
mean     445.000000
std      257.353842
min        0.000000
25%      222.500000
50%      445.000000
75%      667.500000
max      890.000000
Name: index, dtype: float64

For PassengerId
int64
0
count    891.000000
mean     446.000000
std      257.353842
min        1.000000
25%      223.500000
50%      446.000000
75%      668.500000
max      891.000000
Name: PassengerId, dtype: float64

For Survived
int64
0
count    891.000000
mean       0.383838
std        0.486592
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: Survived, dtype: float64

For Pclass
int64
0
count    891.000000
mean       2.308642
std        0.836071
min        1.000000
25%        2.000000
50%        3.000000
75%        3.000000
max        3.000000
Name: Pclass, dtype: float64

For Name
object
0
count                           891
unique                          891
top       Graham, Mr. George Edward
freq                              1
Name: Name, dtype: object

For Sex
object
0
count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

For Age
float64
177
count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%             NaN
50%             NaN
75%             NaN
max       80.000000
Name: Age, dtype: float64

For SibSp
int64
0
count    891.000000
mean       0.523008
std        1.102743
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

For Parch
int64
0
count    891.000000
mean       0.381594
std        0.806057
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max        6.000000
Name: Parch, dtype: float64

For Ticket
object
0
count          891
unique         681
top       CA. 2343
freq             7
Name: Ticket, dtype: object

For Fare
float64
0
count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

For Cabin
object
687
count             204
unique            147
top       C23 C25 C27
freq                4
Name: Cabin, dtype: object

For Embarked
object
2
count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object